app/Models/PatientsModel.php

SELECT *
FROM `patient`
ORDER BY `nom_patient` ASC
---
    public function getPatients()
    {

        $results = $this -> orderby('nom_patient','ASC');
        $results = $this ->find();