app/Models/PraticiensModel.php

SELECT *
FROM `specialite`
ORDER BY `libelle` ASC
---
    public function getSpecialites()
    {
        return $this->db->table('specialite')
                        ->orderBy('libelle', 'ASC')
                        ->get()
                        ->getResultArray();

SELECT `praticien`.*, `specialite`.`libelle`
FROM `praticien`
LEFT JOIN `praticien_specialite` ON `praticien`.`id_praticien` = `praticien_specialite`.`praticien_id`
LEFT JOIN `specialite` ON `praticien_specialite`.`specialite_id` = `specialite`.`id_specialite`
ORDER BY `nom_praticien` ASC
---
    public function getPraticiens()
    {
        return $this->select('praticien.*, specialite.libelle')
                    ->join('praticien_specialite', 'praticien.id_praticien = praticien_specialite.praticien_id', 'left')
                    ->join('specialite', 'praticien_specialite.specialite_id = specialite.id_specialite', 'left')
                    ->orderBy('nom_praticien', 'ASC')
                    ->findAll();

SELECT `praticien`.*, `specialite`.`libelle`
FROM `praticien`
JOIN `praticien_specialite` ON `praticien`.`id_praticien` = `praticien_specialite`.`praticien_id`
JOIN `specialite` ON `praticien_specialite`.`specialite_id` = `specialite`.`id_specialite`
WHERE `specialite`.`id_specialite` = '1'
ORDER BY `nom_praticien` ASC
---
    public function getPraticiensBySpecialite($id_specialite)
    {
        return $this->select('praticien.*, specialite.libelle')
                    ->join('praticien_specialite', 'praticien.id_praticien = praticien_specialite.praticien_id')
                    ->join('specialite', 'praticien_specialite.specialite_id = specialite.id_specialite')
                    ->where('specialite.id_specialite', $id_specialite)
                    ->orderBy('nom_praticien', 'ASC')
                    ->findAll();